_posts/programming/2022-08-02-cppcoreguidelines-c9.html
---
layout: post
title: CppCoreGuidelines C.9 尽量隐藏成员数据
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
C.9: Minimize exposure of members
</p>

<p>
<b>理由</b>
</p>

<p>
数据封装。信息隐藏。避免意外访问。简化代码维护。
</p>

<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">typename</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">T</span>, <span style="color: #7F0055; font-weight: bold;">typename</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">U</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">pair</span> <span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">T</span> <span style="color: #000000; font-style: italic;">a</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">U</span> <span style="color: #000000; font-style: italic;">b</span>;
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
因为 <code>a</code> 和 <code>b</code> 是公开的，不管注释部分提供了什么接口， <code>pair</code> 的用户都可以随意且独立地修改 <code>a</code> 和 <code>b</code> 的数据。在庞大的代码库中，我们难以轻松找到哪些代码修改了 <code>pair</code> 的哪些成员数据。如果我们想强化成员变量之间的关系，最好是把它们设置成私有数据，然后通过构造函数和成员函数来强化他们之间的约束关系（不变体， invariant ）。
</p>

<p>
在以下例子中， <code>meters</code> 函数根据成员变量计算出以米为单位的距离数据。通过
<code>set_unit</code> 设置距离单位信息。这样，就不用直接访问成员数据进行计算，确保了 <code>meters</code> 返回的是正确的数值。想象一下，如果用户不知道 <code>magnitude</code> 和
<code>unit</code> 之间的关系，直接访问 <code>magnitude</code> 就可能用错数据值了。
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Distance</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">meters</span><span style="color: #7388d6;">()</span> <span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #7388d6;">{</span> <span style="color: #7F0055; font-weight: bold;">return</span> magnitude<span style="color: #7F0055; font-weight: bold;">*</span>unit; <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">set_unit</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">u</span><span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
            <span style="color: #3F7F5F;">// ... check that u is a factor of 10 ...</span>
            <span style="color: #3F7F5F;">// ... change magnitude appropriately ...</span>
            <span style="color: #000000;">unit</span> <span style="color: #7F0055; font-weight: bold;">=</span> u;
    <span style="color: #7388d6;">}</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000; font-style: italic;">magnitude</span>;
    <span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000; font-style: italic;">unit</span>;
    <span style="color: #3F7F5F;">// 1 is meters, 1000 is kilometers,</span>
    <span style="color: #3F7F5F;">// 0.001 is millimeters, etc.</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
<b>注意</b>
</p>

<p>
如果哪些用户能直接访问哪些数据还不确定，那么就很难改进这个数据类型。
<code>public</code> 和 <code>protected</code> 成员数据就是这种情况。
</p>


<p>
<b>例子</b>
</p>

<p>
类通常会提供两类接口给用户。一类接口是提供给继承此类的子类（ <code>protected</code>
），另一类提供给普通用户（ <code>public</code> ）。比如，继承的类可以直接跳过运行时检查，因为继承关系已经确保运行时的数据是正确了。
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Foo</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">bar</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> <span style="color: #3a5fcd; font-weight: bold;">check</span><span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>; <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">do_bar</span><span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>; <span style="color: #7388d6;">}</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #7F0055; font-weight: bold;">protected</span>:
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">do_bar</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">)</span>; <span style="color: #3F7F5F;">// do some operation on the data</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #3F7F5F;">// ... data ...</span>
<span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Dir</span> : <span style="color: #7F0055; font-weight: bold;">public</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Foo</span> <span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">//...</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">mem</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">x</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">y</span><span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
        <span style="color: #3F7F5F;">/* ... do something ... */</span>
        <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">do_bar</span><span style="color: #909183;">(</span>x <span style="color: #7F0055; font-weight: bold;">+</span> y<span style="color: #909183;">)</span>;
        <span style="color: #3F7F5F;">// OK: derived class can bypass check</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">user</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Foo</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">x</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">r1</span> <span style="color: #7F0055; font-weight: bold;">=</span> x.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">bar</span><span style="color: #7388d6;">(</span><span style="color: #110099;">1</span><span style="color: #7388d6;">)</span>;      <span style="color: #3F7F5F;">// OK, will check</span>
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">r2</span> <span style="color: #7F0055; font-weight: bold;">=</span> x.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">do_bar</span><span style="color: #7388d6;">(</span><span style="color: #110099;">2</span><span style="color: #7388d6;">)</span>;   <span style="color: #3F7F5F;">// error: would bypass check</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
<b>注意</b>
</p>

<p>
尽量不要用 <code>protected</code> 级别的数据
</p>


<p>
<b>注意</b>
</p>

<p>
按照以下顺序排列成员变量：
</p>
<ul class="org-ul">
<li><code>public</code>,</li>
<li><code>protected</code>,</li>
<li><code>private</code></li>
</ul>


<p>
<b>强化</b>
</p>
<ul class="org-ul">
<li>标记 <code>protected</code> 数据</li>
<li>标记 <code>public</code> 和 <code>private</code> 数据混合在一起的地方</li>
</ul>
